{
  "navbar": {
    "home": {
      "en": "Home",
      "pl": "Strona główna"
    },
    "about": {
      "en": "About",
      "pl": "O mnie"
    },
    "cv": {
      "en": "CV",
      "pl": "CV"
    },
    "projects": {
      "en": "Projects",
      "pl": "Projekty"
    },
    "contact": {
      "en": "Contact",
      "pl": "Kontakt"
    }
  },
  "home": {
    "subtitle": {
      "en": "Software developer",
      "pl": "Programista"
    }
  },
  "about": {
    "pagetitle": {
      "en": "About me",
      "pl": "O mnie"
    },
    "overview": {
      "en": "Overview",
      "pl": "Zarys"
    },
    "overview_text": {
      "en": "I am an ambitious programmer with a strong focus on development and achieving set goals. I value the opportunity to continuously expand my knowledge and take on new challenges, while offering high technical and interpersonal skills.",
      "pl": "Jestem ambitnym programistą z silnym nastawieniem na rozwój i osiąganie wyznaczonych celów. Cenię sobie możliwość ciągłego poszerzania wiedzy i podejmowania nowych wyzwań, zarazem oferując wysokie kompetencje techniczne oraz interpersonalne."
    },
    "experience": {
      "en": "Experience",
      "pl": "Doświadczenie"
    },
    "experience_text": {
      "en": "I have been working as a software developer for over a year now. I have experience in back-end development, however I have no problem with working on front-end projects. I have professionally worked with a variety of technologies, including python with flask and celery frameworks, javascipt in vue.js framework as well as sql. During my studies I also got fluent with c++, c, and java. in my free time I learned swift which I used to create my apps mentioned on projects page.",
      "pl": "Od ponad roku pracuję jako programista. Mam doświadczenie w back-endzie, ale nie mam problemu z pracą nad front-endowymi projektami. Profesjonalnie pracowałem z różnymi technologiami, w tym pythonem z frameworkami flask i celery, javascriptem w frameworku vue.js, a także sql. W trakcie studiów opanowałem również c++, c i java. W wolnym czasie nauczyłem się swifta, którego użyłem do stworzenia aplikacji wymienionych na stronie projektów."
    },
    "education": {
      "en": "Education",
      "pl": "Edukacja"
    },
    "education_text": {
      "en": "I am currently studying computer science at the Warsaw University of Technology, pursuing my master's degree studies. I have completed a number of courses in programming, algorithms, and data structures. During my undergraduate studies I was the year representative for all three years as well as I was the top student in my year for which I received the rector's scholarship.",
      "pl": "Obecnie studiuję informatykę na Politechnice Warszawskiej, realizując studia magisterskie. Ukończyłem szereg kursów z programowania, algorytmów i struktur danych. W trakcie studiów licencjackich byłem przedstawicielem roku dla wszystkich trzech lat, a także byłem najlepszym studentem w swoim roku, za co otrzymałem stypendium rektora."
    },
    "languages": {
      "en": "Languages",
      "pl": "Języki"
    },
    "languages_text": {
      "en": "I'm native in Polish and since my childhood i have been learning English so I can speak it fluently. Recently i have started learning Italian.",
      "pl": "Mówię biegle po polsku, a od dzieciństwa uczę się angielskiego, więc mówię w nim płynnie. Ostatnio zacząłem uczyć się włoskiego."
    },
    "interests": {
      "en": "Interests",
      "pl": "Zainteresowania"
    },
    "interests_text": {
      "en": "In my free time I like to develop my personal projects, play video games, and learn new things. My most recent project revolves around setting up my own server for web hosting, data storage and media streaming. I am also interested in new technologies and gadgets. My latest passion is snowboarding, which I have been practicing since this season. My most extravagant hobby is collecting glassware, especially from the Polish People's Republic era.",
      "pl": "W wolnym czasie lubię rozwijać swoje projekty, grać w gry komputerowe i uczyć się nowych rzeczy. Mój najnowszy projekt dotyczy konfiguracji własnego serwera do hostingu stron internetowych, przechowywania danych i strumieniowania multimediów. Interesuję się również nowymi technologiami i gadżetami. Moją najnowszą pasją jest snowboard, na którym jazdy uczę się od tego sezonu. Moim najbardziej ekstrawaganckim hobby jest kolekcjonowanie szkła, zwłaszcza z okresu Polski Rzeczypospolitej Ludowej."
    }
  },
  "cv": {
    "pagetitle": {
      "en": "Curriculum Vitae",
      "pl": "Curriculum Vitae"
    },
    "button": {
      "en": "Download PDF",
      "pl": "Pobierz PDF"
    }
  },
  "projects": {
    "pagetitle": {
      "en": "My projects (chronologically)",
      "pl": "Moje projekty (chronologicznie)"
    },
    "description": {
      "en": "Description",
      "pl": "Opis"
    },
    "technologies": {
      "en": "Technologies",
      "pl": "Technologie"
    },
    "links": {
      "en": "Links",
      "pl": "Linki"
    },
    "github_repo": {
      "en": "Github repository",
      "pl": "Repozytorium na Githubie"
    },
    "front_end": {
      "en": "Front-end:",
      "pl": "Front-end:"
    },
    "back_end": {
      "en": "Back-end:",
      "pl": "Back-end:"
    },
    "source_code": {
      "en": "Source code:",
      "pl": "Kod źródłowy:"
    },
    "portfolio": {
      "en": "Portfolio website",
      "pl": "Strona portfolio"
    },
    "portfolio_description": {
      "en": "My portfolio is a web application that showcases my projects, skills and experience. It is currently hosted on github pages - you are looking at it right now :).",
      "pl": "Moje portfolio to aplikacja internetowa, która prezentuje moje projekty, umiejętności i doświadczenie. Obecnie jest hostowane na github pages - właśnie na nie patrzysz :)."
    },
    "portfolio_technologies": {
      "en": "Portfolio is fully written in vue.js with tailwind.",
      "pl": "Portfolio jest w pełni napisane w vue.js z tailwind."
    },
    "bachelors": {
      "en": "Bachelor's thesis",
      "pl": "Praca licencjacka"
    },
    "bachelors_description": {
      "en": "My bachelor's thesis was about developing a portable implementation of a digital elevation model (DEM) shading algorithm. The goal was to create a versatile and efficient program for high-quality terrain shading deployable across various platforms and compare its efficiency to other implementations.",
      "pl": "Moja praca licencjacka dotyczyła opracowania przenośnej implementacji algorytmu cieniowania modelu cyfrowego terenu (DEM). Celem było stworzenie wszechstronnego i wydajnego programu do cieniowania terenu wysokiej jakości, który można zastosować na różnych platformach, a także porównanie jego wydajności z innymi implementacjami."
    },
    "bachelors_technologies": {
      "en": "The algorithm was implemented in c++, sycl and cuda.",
      "pl": "Algorytm został zaimplementowany w c++, sycl i cuda."
    },
    "medsys": {
      "en": "Medsys",
      "pl": "Medsys"
    },
    "medsys_description": {
      "en": "Medsys is a web application created during group project class at my undergraduate studies that allows doctors and medical staff of a clinic to register and overview patients and their visits.",
      "pl": "Medsys to aplikacja internetowa stworzona podczas zajęć projektowych na studiach licencjackich, która umożliwia lekarzom i personelowi medycznemu kliniki rejestrację i przegląd pacjentów oraz ich wizyt."
    },
    "medsys_technologies": {
      "en": "Medsys is a full-stack application. The front-end is built using vue.js framework, while the back-end is built using java with spring framework. The application uses a postgresql database to store user and medication data.",
      "pl": "Medsys to aplikacja full-stack. Front-end jest zbudowany przy użyciu frameworka vue.js, a back-end przy użyciu javy z frameworkiem spring. Aplikacja korzysta z bazy danych postgresql do przechowywania danych użytkowników i leków."
    },
    "sudoku": {
      "en": "Sudoku solver",
      "pl": "Sudoku solver"
    },
    "sudoku_description": {
      "en": "Sudoku solver is an app that allows users to input a sudoku board and solve it with a backtracking algorithm.",
      "pl": "Sudoku solver to aplikacja, która pozwala użytkownikom wprowadzić planszę sudoku i rozwiązać ją za pomocą algorytmu backtracking."
    },
    "sudoku_technologies": {
      "en": "Sudoku solver is fully written in python.",
      "pl": "Sudoku solver jest w pełni napisany w pythonie."
    },
    "software_engineering": {
      "en": "Software engineering project",
      "pl": "Projekt z inżynierii oprogramowania"
    },
    "software_engineering_description": {
      "en": "Software engineering project was a group project at my undergraduate studies. The goal was to create an application that would simulate a university platform (like moodle). The whole project was documented using uml.",
      "pl": "Projekt z inżynierii oprogramowania był projektem grupowym na studiach licencjackich. Celem było stworzenie aplikacji, która symulowałaby platformę uniwersytecką (jak moodle). Cały projekt został udokumentowany przy użyciu uml."
    },
    "software_engineering_technologies": {
      "en": "Software engineering project was fully written in c++.",
      "pl": "Projekt z inżynierii oprogramowania był w pełni napisany w c++."
    },
    "divcost": {
      "en": "DivCost",
      "pl": "DivCost"
    },
    "divcost_description": {
      "en": "DivCost is a mobile app that allows users to calculate the money balance of each member of a group. User enters all the expenses and attributes them to according people. When all data is entered user can preview the balances of all people and can generate a suggested, optimised and minimised return transactions.",
      "pl": "DivCost to aplikacja mobilna, która pozwala użytkownikom obliczyć bilans pieniężny każdego członka grupy. Użytkownik wprowadza wszystkie wydatki i przypisuje je odpowiednim osobom. Po wprowadzeniu wszystkich danych użytkownik może zobaczyć bilanse wszystkich osób i wygenerować sugerowane, zoptymalizowane i ze zminimalizowanymi transakcjami zwrotnymi."
    },
    "divcost_technologies": {
      "en": "DivCost is fully written in swift.",
      "pl": "DivCost jest w pełni napisany w swift."
    },
    "ticker": {
      "en": "Ticker",
      "pl": "Ticker"
    },
    "ticker_description": {
      "en": "Ticker is a mobile app that allows users to write down lists of products to buy. Its main feature is the individual lists for shops (for example a list for lidl and a list for auchan).",
      "pl": "Ticker to aplikacja mobilna, która pozwala użytkownikom zapisać listy produktów do kupienia. Jej główną funkcją są indywidualne listy dla sklepów (na przykład lista dla lidla i lista dla auchan)."
    },
    "ticker_technologies": {
      "en": "Ticker is fully written in swift.",
      "pl": "Ticker jest w pełni napisany w swift."
    }
  },
  "contact": {
    "pagetitle": {
      "en": "Contact me",
      "pl": "Skontaktuj się ze mną"
    },
    "email": {
      "en": "Email",
      "pl": "Email"
    },
    "email_description": {
      "en": "You can contact me via email at",
      "pl": "Możesz się ze mną skontaktować mailowo pod adresem"
    },
    "linkedin": {
      "en": "LinkedIn",
      "pl": "LinkedIn"
    },
    "linkedin_description": {
      "en": "You can find me on LinkedIn at",
      "pl": "Możesz mnie znaleźć na LinkedIn pod adresem"
    },
    "github": {
      "en": "GitHub",
      "pl": "GitHub"
    },
    "github_description": {
      "en": "You can find me on GitHub at",
      "pl": "Możesz mnie znaleźć na GitHub pod adresem"
    }
  }
}
